import images from "../images/image";

export const carouselItems = [
  {
    src: images.onboard1,
    title: 'ยินดีต้อนรับ!',
    text: `IconKaset เชื่อมคุณสู่โลกการจ้างงานบินโดรนเกษตร
    อย่างอิสระ พร้อมบริหารแปลงเกษตรอย่างคุณภาพ`,
  },
  {
    src: images.onboard2,
    title: 'จ้างงานได้ทุกที่ทุกเวลา',
    text: `ไม่ว่าจะอยู่บ้านอยู่แปลงเกษตร 
    หรือกำลังเดินทาง ก็สามารถจ้างงานได้ง่ายทุกเวลา`,
  },
  {
    src: images.onboard3,
    title: 'การันตีมีคนรับงาน',
    text: `หมดกังวลปัญหานักบินไม่รับงาน 
    ด้วยการคัดสรรนักบินโดรนคุณภาพผ่านการรับรอง`,
  },
];

export const condition = `สำหรับผู้รับบริการจากการให้บริการผ่านแพลตฟอร์มรับงานบินโดรนเกษตร “แอปพลิเคชันไอคอนเกษตรนักบิน”

  เงื่อนไขและข้อตกลงนี้เป็นเงื่อนไขและข้อตกลงระหว่าง ไอคอนเกษตร (“บริษัท”) และผู้ใช้งาน และ/หรือ ผู้ให้บริการ(“ท่าน”) หากท่านได้สร้างบัญชีผู้ใช้งานและกดยอมรับเงื่อนไขและข้อตกลงในการใช้บริการแล้วจะถือว่า ท่านได้เห็นด้วยและตกลงกับเงื่อนไขและข้อกำหนดนี้แล้วทุกประการ หากท่านไม่เห็นด้วยกับเงื่อนไขและข้อตกลงการใช้บริการนี้ ขอให้ท่านกดยกเลิก หรือปฎิเสธการสร้างบัญชีผู้ใช้ และ/หรือการเข้าใช้แพลตฟอร์ม
  
  1. คำจำกัดความ
  เว้นแต่จะได้กำหนดไว้โดยเฉพาะในข้อกำหนดและเงื่อนไขเฉพาะของบริการแต่ละประเภท คำต่อไปนี้ให้หมายความตามที่ระบุไว้ดังนี้
  
  “บริษัทฯ” หมายถึง บริษัท ไอคอนเกษตร จำกัด ซึ่งเป็นผู้พัฒนา เป็นเจ้าของ และให้บริการแอปพลิเคชันไอคอนเกษตรนักบิน นี้ 
  
  “แอปพลิเคชันไอคอนเกษตร” หมายถึง แอปพลิเคชัน หรือเว็บไซต์ที่พัฒนา ถือกรรมสิทธิ์ และให้บริการโดยบริษัทฯ ซึ่งผู้ใช้สามารถใช้ส่งคำร้องขอใช้บริการบินโดรนเกษตรจากนักบินโดรนได้
  
  “แอปพลิเคชันไอคอนเกษตรนักบิน” หมายถึง แอปพลิเคชัน ที่พัฒนา ถือกรรมสิทธิ์ และให้บริการโดยบริษัทฯ ซึ่งผู้ใช้สามารถรับงานบินโดรนจากผู้ใช้บริการได้
  
  “บริการบินโดรนเกษตร” หมายถึง บริการบินโดรนฉีดพ่นแปลงเกษตรให้กับผู้ใช้งาน โดยที่ผู้ใช้งานสามารถเรียกให้นักบินโดรนไปฉีดพ่นปุ๋ย/ยา ให้กับแปลงเกษตรได้ตามวันนัดหมายที่กำหนดกับทางแอปพลิเคชันไอคอนเกษตร
  
  “ผู้ให้บริการ/ นักบินโดรน” หมายถึง นักบินโดรนที่ได้ลงทะเบียนไว้กับบริษัทฯ ตามข้อกำหนดและเงื่อนไขระหว่างบริษัทฯ และนักบินโดรน ตามที่ระบุไว้ในข้อกำหนดการใช้งานของแอปพลิเคชันไอคอนเกษตรนักบิน เพื่อให้บริการบินโดรนแก่ผู้ใช้งาน
  
  “ผู้ใช้/ เกษตรกร” หมายถึง ผู้ใช้แอปพลิเคชันไอคอนเกษตร ที่ส่งคำสั่งในการใช้บริการบินโดรนเกษตรจาก ผู้ให้บริการ
  
  “ค่าบริการ” หมายถึง ค่าบริการที่ผู้ให้บริการได้รับเพื่อเป็นการตอบแทนการให้บริการแก่ผู้ใช้
  
  2. ข้อตกลง
  นอกจากข้อกำหนดที่ระบุไว้ในข้อกำหนดหลักในการใช้แล้ว ผู้ใช้ที่ใช้บริการบินโดรนเกษตรตกลงที่จะปฏิบัติตามข้อกำหนด ดังต่อไปนี้
  
  2.1     บริษัทฯ เป็นเพียงผู้ให้ข้อมูล และผู้ให้บริการด้านเทคโนโลยีเพื่ออำนวยความสะดวกในการติดต่อ และตอบรับคำขอใช้บริการบินโดรนที่ผู้ใช้ต้องการเรียกนักบินโดรน โดยทำหน้าที่คำนวณระยะทางในการเดินทางโดยประมาณในฉีดพ่นปุ๋ย/ยา รวมทั้งให้ข้อมูลเพื่อติดต่อผู้ใช้ อย่างไรก็ตาม บริษัทฯ ไม่ได้เป็นผู้ให้บริการบินโดรนเกษตร ทั้งไม่ได้ให้บริการ หรือดำเนินการใด ๆ ที่จะถือได้ว่าบริษัทฯ เป็นผู้ให้บริการบินโดรนเกษตร และบริษัทฯ ไม่มีส่วนเกี่ยวข้องในบริการบินโดรนเกษตร และไม่มีความรับผิดชอบในการบริการบินโดรนเกษตร โดยบริการบินโดรนเกษตรใด ๆ ก็ตามเป็นกิจการโดยตรงระหว่างผู้ใช้และนักบินโดรน
  2.2     บริการบินโดรนเกษตรนี้ถือว่าเป็นการให้บริการของนักบินโดรนเอง และไม่ถือเป็นการบริการของบริษัทฯ เมื่อนักบินโดรนตอบรับคำขอใช้บริการบินโดรนเกษตรของผู้ใช้แล้ว นักบินโดรนจะเห็นข้อมูลเบื้องต้นเกี่ยวกับผู้ใช้ เช่น ชื่อ ที่อยู่การให้บริการ รายละเอียดบริการบินโดรนเกษตร  หมายเลขโทรศัพท์ และคะแนนความพอใจ (หากมี) โดยนักบินโดรนจะพิจารณาและตอบรับคำขอใช้บริการบินโดรนเกษตร และรับความเสี่ยงใดๆ ที่อาจเกิดจากบริการบินโดรนของนักบินโดรนเองด้วยความสมัครใจ บริษัทฯ ไม่มีหน้าที่และความรับผิดชอบ ไม่ว่าโดยทางตรงและทางอ้อม
  
  2.3     ผู้ให้บริการจะต้องให้บริการบินโดรนเกษตรโดยไม่ก่อให้เกิดความเสียหายแก่ผู้ใช้ หรือบุคคลภายนอก ท่านตกลงที่จะเป็นผู้รับผิดชอบในความเสียหายนั้น ๆ จนเต็มจำนวนแต่เพียงผู้เดียว  บริษัทฯ จะไม่รับผิดชอบไม่ว่าในกรณีใด และผู้ใช้มีสิทธิที่จะปฏิเสธ/ยกเลิกใช้บริการบินโดรนเกษตร
  
  3. ข้อสงวนสิทธิในการรับประกัน
  3.1     บริษัทฯ ไม่รับรอง รับประกัน และไม่รับผิดในความสูญเสีย หรือเสียหายของแปลงเกษตร อันเนื่องมาจากการใช้ปุ๋ย/ยา หรือ การผสมยา ที่ทางผู้ใช้ให้นักบินโดรนเตรียมปุ๋ย/ยา ให้สำหรับการบริการบินโดรนเกษตร
  
  3.2     ในกรณีที่บินแล้วเกิดความเสียหายต่อโดรน เช่น ตก หรือ เกิดความเสียหายต่อตัวเครื่อง ทางบริษัทจะไม่ได้รับผิดชอบต่อความเสียหายนั้นๆ
  
  4. การส่งคำสั่ง
  เมื่อผู้ใช้คลิกปุ่ม “จองนักบินโดรน” ระบบจะจับคู่คำสั่งของผู้ใช้กับนักบินโดรนที่ได้รับเลือกโดยอัตโนมัติ
  
  5. การรับบริการบินโดรน
  5.1     เมื่อผู้ใช้คลิกปุ่ม "รับงาน" ระบบจะส่งรายละเอียดข้อมูลของท่านไปยังเกษตรกร และเป็นหน้าที่ และความรับผิดชอบของท่านในการทำงานที่กดรับแล้ว ให้เสร็จตามงานที่ได้รับมอบหมายนั้นๆ ถ้ามีคำถามเพิ่มเติมในงาน หรือมีปัญหาใดเกิดขึ้นกรุณาติดต่อไปยังบริษัทเพื่อขอคำแนะนำเพิ่มเติม
  
  6. ราคาและการชำระเงิน
  6.1     ค่าบริการทั้งหมดสำหรับบริการบินโดรนเกษตรจะเกิดขึ้นทันทีหลังจากระยะเวลาผ่านไป 5 นาที ผู้ใช้จะต้องชำระค่าบริการสำหรับบริการบินโดรนเกษตรด้วยเงินสด โดยชำระให้กับนักบินโดรนที่หน้างานหรือสถานที่ที่ให้บริการบินโดรนเกษตร หรือโดยวิธีอื่น ๆ ที่บริษัทฯ อาจเปลี่ยนแปลงเป็นคราว ๆ
  
  6.2     ผู้ใช้จะเป็นผู้รับผิดชอบค่าใช้จ่ายทั้งหมดในการติดต่อกับนักบินโดรนแต่เพียงฝ่ายเดียว
  
  6.3     นักบินโดรนจะต้องดำเนินการรับเงินสดทันที หลังดำเนินการให้บริการบินโดรนเกษตรเรียบร้อย
  
  
  7. การยกเลิก
  เงื่อนไขในการยกเลิกการใช้บริการบินโดรนเกษตรมีดังนี้
  7.1     ผู้ใช้มีสิทธิยกเลิกคำสั่งได้ไม่ว่าในเวลาใดภายใน 24 ชั่วโมง นับจากการจับคู่คำสั่งกับนักบินโดรน
  
  7.2     หากผู้ใช้ยกเลิกคำสั่งภายหลังจากที่ระยะเวลา 24 ชั่วโมงดังกล่าวผ่านไปแล้ว ผู้ใช้จะต้องกำเนินการติดต่อเจ้าหน้าที่ เพื่อขอทำการยกเลิกใช้บริการสำหรับบริการบินโดรนเกษตร บริษัทฯ สงวนสิทธิที่จะเปลี่ยน และ/หรือ เพิ่มค่าบริการสำหรับบริการบินโดรนเกษตรในกรณีที่มีการยกเลิก โดยจะแจ้งให้ผู้ใช้ทราบเป็นคราว ๆ
  
  เงื่อนไขและข้อตกลงฉบับนี้ให้ถือว่า มีผลบังคับนับแต่เวลาที่ท่านได้สร้างบัญชีผู้ใช้สร็จสิ้นและสิ้นสุดลงเมื่อบริษัท หรือท่านได้ยกเลิกบัญชีผู้ใช้
   
  8. ช่องทางติดต่อ
  หากนักบินโดรน มีคำถามเกี่ยวกับข้อกำหนดหลักเกี่ยวกับการบริการ หรือปัญหาเกี่ยวกับการใช้แอปพลิเคชันไอคอนเกษตร กรุณาติดต่อบริษัทฯ ตามที่อยู่อีเมล app.iconkaset@iconkaset.com`;
